# Проект FitLife - MVP версия 1.0


# 1. Знакомство
print('Привет! Я бот FitLife. Давай познакомимся.')
# TODO: Спроси у пользователя имя и сохрани в переменную user_name
user_name = input('Как тебя зовут? ')
# TODO: Спроси возраст и сохрани в переменную user_age
user_age = int(input('Сколько тебе лет? '))

# 2. Сбор данных
# TODO: Запроси вес (в кг) и сохрани в user_weight (тип float)
user_weight = float(input('Введи свой вес (в кг): '))
# TODO: Запроси рост (в метрах, например 1.75)
user_height = float(input('Введи свой рост (в метрах, например, 1.75): '))


# 3. Логика расчетов (Функции как "черный ящик": используем арифметику)
# Формула ИМТ: вес разделить на (рост в квадрате)
# TODO: Рассчитай bmi (Индекс массы тела)
bmi = user_weight / (user_height ** 2)
bmi = round(bmi, 1)


# Подсчет воды: вес * 30 мл
# TODO: Рассчитай water_needed
WATER_PER_KG = 30
ML_IN_L = 1000
water_ml = user_weight * WATER_PER_KG
water_l = round(water_ml / ML_IN_L, 1)


# 4. Вывод красивого результата
# TODO: Используй f-строку, чтобы вывести приветствие
print(end='\n')
print(f'Отчёт для пользователя: {user_name} ({user_age})')
# TODO: Выведи возраст, ИМТ (округленный до 1 знака) и норму воды.
print(f'Твой Индекс Массы Тела: {bmi}')
print(f'Рекомендуется нормы воды: {water_l} л в день')
print(end='\n')
print('Расчёт окончен. Будьте здоровы!')
